avrxml/AS6-Devices-XML/ATSAM3S2A.xml
        <register caption="Master Configuration Register 1" name="MATRIX_MCFG1" offset="0x4" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 2" name="MATRIX_MCFG2" offset="0x8" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Master Configuration Register 3" name="MATRIX_MCFG3" offset="0xC" rw="RW" size="4">
          <bitfield caption="Undefined Length Burst Type" mask="0x00000007" name="ULBT"/>
        </register>
        <register caption="Slave Configuration Register 0" name="MATRIX_SCFG0" offset="0x40" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 1" name="MATRIX_SCFG1" offset="0x44" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 2" name="MATRIX_SCFG2" offset="0x48" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 3" name="MATRIX_SCFG3" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Slave Configuration Register 4" name="MATRIX_SCFG4" offset="0x50" rw="RW" size="4">
          <bitfield caption="Maximum Number of Allowed Cycles for a Burst" mask="0x000000FF" name="SLOT_CYCLE"/>
          <bitfield caption="Default Master Type" mask="0x00030000" name="DEFMSTR_TYPE"/>
          <bitfield caption="Fixed Default Master" mask="0x001C0000" name="FIXED_DEFMSTR"/>
          <bitfield caption="Arbitration Type" mask="0x03000000" name="ARBT"/>
        </register>
        <register caption="Priority Register A for Slave 0" name="MATRIX_PRAS0" offset="0x0080" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 1" name="MATRIX_PRAS1" offset="0x0088" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 2" name="MATRIX_PRAS2" offset="0x0090" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 3" name="MATRIX_PRAS3" offset="0x0098" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="Priority Register A for Slave 4" name="MATRIX_PRAS4" offset="0x00A0" rw="RW" size="4">
          <bitfield caption="Master 0 Priority" mask="0x00000003" name="M0PR"/>
          <bitfield caption="Master 1 Priority" mask="0x00000030" name="M1PR"/>
          <bitfield caption="Master 2 Priority" mask="0x00000300" name="M2PR"/>
          <bitfield caption="Master 3 Priority" mask="0x00003000" name="M3PR"/>
          <bitfield caption="Master 4 Priority" mask="0x00030000" name="M4PR"/>
        </register>
        <register caption="System I/O Configuration register" name="CCFG_SYSIO" offset="0x0114" rw="RW" size="4">
          <bitfield caption="PB4 or TDI Assignment" mask="0x00000010" name="SYSIO4"/>
          <bitfield caption="PB5 or TDO/TRACESWO Assignment" mask="0x00000020" name="SYSIO5"/>
          <bitfield caption="PB6 or TMS/SWDIO Assignment" mask="0x00000040" name="SYSIO6"/>
          <bitfield caption="PB7 or TCK/SWCLK Assignment" mask="0x00000080" name="SYSIO7"/>
          <bitfield caption="PB10 or DDM Assignment" mask="0x00000400" name="SYSIO10"/>
          <bitfield caption="PB11 or DDP Assignment" mask="0x00000800" name="SYSIO11"/>
          <bitfield caption="PB12 or ERASE Assignment" mask="0x00001000" name="SYSIO12"/>
        </register>
        <register caption="SMC Chip Select NAND Flash Assignment Register" name="CCFG_SMCNFCS" offset="0x011C" rw="RW" size="4">
          <bitfield caption="SMC NAND Flash Chip Select 0 Assignment" mask="0x00000001" name="SMC_NFCS0"/>
          <bitfield caption="SMC NAND Flash Chip Select 1 Assignment" mask="0x00000002" name="SMC_NFCS1"/>
          <bitfield caption="SMC NAND Flash Chip Select 2 Assignment" mask="0x00000004" name="SMC_NFCS2"/>
          <bitfield caption="SMC NAND Flash Chip Select 3 Assignment" mask="0x00000008" name="SMC_NFCS3"/>
        </register>
